InformationRegisters/ПоясненияКартДизайнПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПоясненияКартДизайнПроектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пояснение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяПоля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПродукции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоясненияКартДизайнПроектов/Ext/ManagerModule.bsl
Функция ПолучитьПояснение(ИмяПоля, ТипПродукции) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяПоля = ИмяПоля;
	МенеджерЗаписи.ТипПродукции = ТипПродукции;
	МенеджерЗаписи.Прочитать();
	
	Возврат ?(МенеджерЗаписи.Выбран(), МенеджерЗаписи.Пояснение, Неопределено);
	
КонецФункции

//+++АК SHEP 2018.05.30 ИП-00018753.01
Функция ПолучитьВсеПояснения(ТипПродукции) Экспорт
	
	СтруктураПояснений = Новый Структура;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПоясненияКартДизайнПроектов.ИмяПоля КАК Ключ,
		|	ПоясненияКартДизайнПроектов.Пояснение КАК Значение
		|ИЗ
		|	РегистрСведений.ПоясненияКартДизайнПроектов КАК ПоясненияКартДизайнПроектов
		|ГДЕ
		|	ПоясненияКартДизайнПроектов.ТипПродукции = &ТипПродукции");
	Запрос.УстановитьПараметр("ТипПродукции", ТипПродукции);
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			СтруктураПояснений.Вставить(ВыборкаЗапроса.Ключ, ВыборкаЗапроса.Значение);
		КонецЦикла;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураПояснений;
	
КонецФункции
